Revit 2027 API
MEPAnalyticalNode.Id Property
 The identity used in the MEPAnalyticalSegment
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Id { get; }
Public ReadOnly Property Id As Integer
	Get
public:
property int Id {
	int get ();
}
member Id : int with get
Property Value
Int32
See Also
Reference
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace